erp3l/src/Catalogs/ПараметрыРасчетаРезервовПоДЗ/ПараметрыРасчетаРезервовПоДЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыРасчетаРезервовПоДЗ</name>
  <predefined>
    <items>
      <name>КлассНадежностиКонтрагента</name>
      <description>Класс надежности контрагента</description>
    </items>
    <items>
      <name>КоэффициентСрокаПогашения</name>
      <description>Коэффициент срока погашения</description>
    </items>
  </predefined>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПараметраРасчетаРезервов</name>
    <type>
      <types>EnumRef.ТипыПараметровРасчетаРезерва</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Enums/ТипыПараметровРасчетаРезерва/ТипыПараметровРасчетаРезерва.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПараметровРасчетаРезерва</name>
  <enumValues>
    <name>Вычисляемый</name>
  </enumValues>
  <enumValues>
    <name>ПоКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговору</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ПараметрыРасчетаРезервовПоДЗ/ManagerModule.bsl
Процедура ОбновитьПредопределенные() Экспорт

	Объект = Справочники.ПараметрыРасчетаРезервовПоДЗ.КлассНадежностиКонтрагента.ПолучитьОбъект();
	Объект.Используется = Истина;
	Объект.Алгоритм = "";
	Объект.ТипПараметраРасчетаРезервов = Перечисления.ТипыПараметровРасчетаРезерва.ПоКонтрагенту;
	Объект.Записать();

	Объект = Справочники.ПараметрыРасчетаРезервовПоДЗ.КоэффициентСрокаПогашения.ПолучитьОбъект();
	Объект.Используется = Истина;
	Объект.Алгоритм = "РасчетноеЗначение = ПолучитьДолюПросрочки(СтрокаДокументаРезерв);";
	Объект.ТипПараметраРасчетаРезервов = Перечисления.ТипыПараметровРасчетаРезерва.Вычисляемый;
	Объект.Записать();
		
КонецПроцедуры

Процедура Обновление_1_0_1_140() Экспорт


КонецПроцедуры
